public/webpack-dev-server-proxy.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2020-11-02 Mon 15:07 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Webpack Dev Server Proxy</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Jack Liu">
<link rel="shortcut icon" href="/images/rose-red.png" type="image/x-icon" />
<link rel="stylesheet" href="/css/animate.min.css" />
<link rel="stylesheet" href="/css/all.min.css" />
<link rel="stylesheet" type="text/css" href="/css/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">Webpack Dev Server Proxy</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org031ebab">基本用法</a></li>
<li><a href="#orgd5400a0">代理多个路径</a></li>
<li><a href="#orgd79441f">忽略API前缀</a></li>
<li><a href="#orge20ccb4">忽略https安全提示</a></li>
<li><a href="#org889266f">自定义规则</a></li>
<li><a href="#orgea741fd">跨域</a></li>
<li><a href="#org5a36a39">配置多个规则：Vue-cli中 `proxyTable` 配置接口</a></li>
<li><a href="#org6fcdfb3">更多参数</a></li>
<li><a href="#orge1e0de9">vue-element-admin分析代码</a></li>
</ul>
</div>
</div>
<p>
→ 转载自 <a href="https://www.cnblogs.com/liuguiqian/p/11362211.html">详解Webpack-dev-server的proxy用法</a> ，了解更多<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>
</p>

<p>
解决开发环境的跨域问题(不用在去配置nginx和host, 爽歪歪~~)
</p>

<p>
*注：F12 查看网络请求路径，还是原来的，所以只能从效果上去观察是否正确代理了。
</p>

<div id="outline-container-org031ebab" class="outline-2">
<h2 id="org031ebab">基本用法</h2>
<div class="outline-text-2" id="text-org031ebab">
<div class="org-src-container">
<pre class="src src-js"><span class="linenr"> 1: </span>module.exports = <span style="color: #AF87FF;">{</span>
<span class="linenr"> 2: </span>    <span style="color: #8B8878;">//</span><span style="color: #8B8878;">...</span>
<span class="linenr"> 3: </span>    devServer: <span style="color: #5FD7FF;">{</span>
<span class="linenr"> 4: </span>        proxy: <span style="color: #87D700;">{</span>
<span class="linenr"> 5: </span>            <span style="color: #CDC673;">'/api'</span>: <span style="color: #CDC673;">'http://localhost:3000'</span>
<span class="linenr"> 6: </span>        <span style="color: #87D700;">}</span>
<span class="linenr"> 7: </span>    <span style="color: #5FD7FF;">}</span>
<span class="linenr"> 8: </span><span style="color: #AF87FF;">}</span>;
<span class="linenr"> 9: </span>
<span class="linenr">10: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#35831;&#27714;&#21040; `/api/xxx` &#29616;&#22312;&#20250;&#34987;&#20195;&#29702;&#21040;&#35831;&#27714; http://localhost:3000/api/xxx &#65292;</span>
<span class="linenr">11: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#20363;&#22914; `/api/user` &#29616;&#22312;&#20250;&#34987;&#20195;&#29702;&#21040;&#35831;&#27714; http://localhost:3000/api/user</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd5400a0" class="outline-2">
<h2 id="orgd5400a0">代理多个路径</h2>
<div class="outline-text-2" id="text-orgd5400a0">
<div class="org-src-container">
<pre class="src src-js"><span class="linenr"> 1: </span>module.exports = <span style="color: #AF87FF;">{</span>
<span class="linenr"> 2: </span>    <span style="color: #8B8878;">//</span><span style="color: #8B8878;">...</span>
<span class="linenr"> 3: </span>    devServer: <span style="color: #5FD7FF;">{</span>
<span class="linenr"> 4: </span>        proxy: <span style="color: #87D700;">[</span><span style="color: #CDC673;">{</span>
<span class="linenr"> 5: </span>            context: <span style="color: #FF8C00;">[</span><span style="color: #CDC673;">'/auth'</span>, <span style="color: #CDC673;">'/api'</span><span style="color: #FF8C00;">]</span>,
<span class="linenr"> 6: </span>            target: <span style="color: #CDC673;">'http://localhost:3000'</span>,
<span class="linenr"> 7: </span>        <span style="color: #CDC673;">}</span><span style="color: #87D700;">]</span>
<span class="linenr"> 8: </span>    <span style="color: #5FD7FF;">}</span>
<span class="linenr"> 9: </span><span style="color: #AF87FF;">}</span>;
<span class="linenr">10: </span>
<span class="linenr">11: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#22914;&#26524;&#20320;&#24819;&#35201;&#20195;&#30721;&#22810;&#20010;&#36335;&#24452;&#20195;&#29702;&#21040;&#21516;&#19968;&#20010; `target` &#19979;&#65292;</span>
<span class="linenr">12: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#20320;&#21487;&#20197;&#20351;&#29992;&#30001;&#19968;&#20010;&#25110;&#22810;&#20010;&#12300;&#20855;&#26377; `context` &#23646;&#24615;&#30340;&#23545;&#35937;&#12301;&#26500;&#25104;&#30340;&#25968;&#32452;&#65306;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd79441f" class="outline-2">
<h2 id="orgd79441f">忽略API前缀</h2>
<div class="outline-text-2" id="text-orgd79441f">
<div class="org-src-container">
<pre class="src src-js"><span class="linenr"> 1: </span>module.exports = <span style="color: #AF87FF;">{</span>
<span class="linenr"> 2: </span>    <span style="color: #8B8878;">//</span><span style="color: #8B8878;">...</span>
<span class="linenr"> 3: </span>    devServer: <span style="color: #5FD7FF;">{</span>
<span class="linenr"> 4: </span>        proxy: <span style="color: #87D700;">{</span>
<span class="linenr"> 5: </span>            <span style="color: #CDC673;">'/api'</span>: <span style="color: #CDC673;">{</span>
<span class="linenr"> 6: </span>                target: <span style="color: #CDC673;">'http://localhost:3000'</span>,
<span class="linenr"> 7: </span>                pathRewrite: <span style="color: #FF8C00;">{</span><span style="color: #CDC673;">'^/api'</span> : <span style="color: #CDC673;">''</span><span style="color: #FF8C00;">}</span>
<span class="linenr"> 8: </span>            <span style="color: #CDC673;">}</span>
<span class="linenr"> 9: </span>        <span style="color: #87D700;">}</span>
<span class="linenr">10: </span>    <span style="color: #5FD7FF;">}</span>
<span class="linenr">11: </span><span style="color: #AF87FF;">}</span>;
<span class="linenr">12: </span>
<span class="linenr">13: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#35831;&#27714;&#21040; `/api/xxx` &#29616;&#22312;&#20250;&#34987;&#20195;&#29702;&#21040;&#35831;&#27714; http://localhost:3000/xxx &#65292;</span>
<span class="linenr">14: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#20363;&#22914; `/api/user` &#29616;&#22312;&#20250;&#34987;&#20195;&#29702;&#21040;&#35831;&#27714; http://localhost:3000/user</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge20ccb4" class="outline-2">
<h2 id="orge20ccb4">忽略https安全提示</h2>
<div class="outline-text-2" id="text-orge20ccb4">
<div class="org-src-container">
<pre class="src src-js"><span class="linenr"> 1: </span>module.exports = <span style="color: #AF87FF;">{</span>
<span class="linenr"> 2: </span>    <span style="color: #8B8878;">//</span><span style="color: #8B8878;">...</span>
<span class="linenr"> 3: </span>    devServer: <span style="color: #5FD7FF;">{</span>
<span class="linenr"> 4: </span>        proxy: <span style="color: #87D700;">{</span>
<span class="linenr"> 5: </span>            <span style="color: #CDC673;">'/api'</span>: <span style="color: #CDC673;">{</span>
<span class="linenr"> 6: </span>                target: <span style="color: #CDC673;">'https://other-server.example.com'</span>,
<span class="linenr"> 7: </span>                secure: <span style="color: #AF87FF;">false</span>
<span class="linenr"> 8: </span>            <span style="color: #CDC673;">}</span>
<span class="linenr"> 9: </span>        <span style="color: #87D700;">}</span>
<span class="linenr">10: </span>    <span style="color: #5FD7FF;">}</span>
<span class="linenr">11: </span><span style="color: #AF87FF;">}</span>;
<span class="linenr">12: </span>
<span class="linenr">13: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#40664;&#35748;&#24773;&#20917;&#19979;&#65292;&#19981;&#25509;&#21463;&#36816;&#34892;&#22312; HTTPS &#19978;&#65292;&#19988;&#20351;&#29992;&#20102;&#26080;&#25928;&#35777;&#20070;&#30340;&#21518;&#31471;&#26381;&#21153;&#22120;&#12290;</span>
<span class="linenr">14: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#22914;&#26524;&#20320;&#24819;&#35201;&#25509;&#21463;&#65292;&#21482;&#35201;&#35774;&#32622; `secure: false` &#23601;&#34892;&#12290;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org889266f" class="outline-2">
<h2 id="org889266f">自定义规则</h2>
<div class="outline-text-2" id="text-org889266f">
<div class="org-src-container">
<pre class="src src-js"><span class="linenr"> 1: </span>module.exports = <span style="color: #AF87FF;">{</span>
<span class="linenr"> 2: </span>    <span style="color: #8B8878;">//</span><span style="color: #8B8878;">...</span>
<span class="linenr"> 3: </span>    devServer: <span style="color: #5FD7FF;">{</span>
<span class="linenr"> 4: </span>        proxy: <span style="color: #87D700;">{</span>
<span class="linenr"> 5: </span>            <span style="color: #CDC673;">'/api'</span>: <span style="color: #CDC673;">{</span>
<span class="linenr"> 6: </span>                target: <span style="color: #CDC673;">'http://localhost:3000'</span>,
<span class="linenr"> 7: </span>                <span style="color: #87D700;">bypass</span>: <span style="color: #FF1493;">function</span><span style="color: #FF8C00;">(</span><span style="color: #FF8C00;">req</span>, <span style="color: #FF8C00;">res</span>, <span style="color: #FF8C00;">proxyOptions</span><span style="color: #FF8C00;">)</span> <span style="color: #FF8C00;">{</span>
<span class="linenr"> 8: </span>                    <span style="color: #FF1493;">if</span> <span style="color: #FF1493;">(</span>req.headers.accept.indexOf<span style="color: #AF87FF;">(</span><span style="color: #CDC673;">'html'</span><span style="color: #AF87FF;">)</span> !== -1<span style="color: #FF1493;">)</span> <span style="color: #FF1493;">{</span>
<span class="linenr"> 9: </span>                        console.log<span style="color: #AF87FF;">(</span><span style="color: #CDC673;">'Skipping proxy for browser request.'</span><span style="color: #AF87FF;">)</span>;
<span class="linenr">10: </span>                        <span style="color: #FF1493;">return</span> <span style="color: #CDC673;">'/index.html'</span>;
<span class="linenr">11: </span>                    <span style="color: #FF1493;">}</span>
<span class="linenr">12: </span>                <span style="color: #FF8C00;">}</span>
<span class="linenr">13: </span>            <span style="color: #CDC673;">}</span>
<span class="linenr">14: </span>        <span style="color: #87D700;">}</span>
<span class="linenr">15: </span>    <span style="color: #5FD7FF;">}</span>
<span class="linenr">16: </span><span style="color: #AF87FF;">}</span>;
<span class="linenr">17: </span>
<span class="linenr">18: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#26377;&#26102;&#20320;&#19981;&#24819;&#20195;&#29702;&#25152;&#26377;&#30340;&#35831;&#27714;&#65292;&#21487;&#20197;&#22522;&#20110;&#19968;&#20010;&#20989;&#25968;&#30340;&#36820;&#22238;&#20540;&#32469;&#36807;&#20195;&#29702;&#12290;</span>
<span class="linenr">19: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#22312;&#20989;&#25968;&#20013;&#20320;&#21487;&#20197;&#35775;&#38382;&#35831;&#27714;&#20307;&#12289;&#21709;&#24212;&#20307;&#21644;&#20195;&#29702;&#36873;&#39033;&#65292;&#24517;&#39035;&#36820;&#22238; false &#25110;&#36335;&#24452;&#65292;&#26469;&#36339;&#36807;&#20195;&#29702;&#35831;&#27714;&#12290;</span>
<span class="linenr">20: </span>
<span class="linenr">21: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#20363;&#22914;&#65306;&#23545;&#20110;&#27983;&#35272;&#22120;&#35831;&#27714;&#65292;&#20320;&#24819;&#35201;&#25552;&#20379;&#19968;&#20010; HTML &#39029;&#38754;&#65292;&#20294;&#26159;&#23545;&#20110; API &#35831;&#27714;&#21017;&#20445;&#25345;&#20195;&#29702;&#12290;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgea741fd" class="outline-2">
<h2 id="orgea741fd">跨域</h2>
<div class="outline-text-2" id="text-orgea741fd">
<div class="org-src-container">
<pre class="src src-js"><span class="linenr"> 1: </span>module.exports = <span style="color: #AF87FF;">{</span>
<span class="linenr"> 2: </span>    <span style="color: #8B8878;">//</span><span style="color: #8B8878;">...</span>
<span class="linenr"> 3: </span>    devServer: <span style="color: #5FD7FF;">{</span>
<span class="linenr"> 4: </span>        proxy: <span style="color: #87D700;">{</span>
<span class="linenr"> 5: </span>            <span style="color: #CDC673;">'/api'</span>: <span style="color: #CDC673;">{</span>
<span class="linenr"> 6: </span>                target: <span style="color: #CDC673;">'http://localhost:3000'</span>,
<span class="linenr"> 7: </span>                changeOrigin: <span style="color: #AF87FF;">true</span>,
<span class="linenr"> 8: </span>            <span style="color: #CDC673;">}</span>
<span class="linenr"> 9: </span>        <span style="color: #87D700;">}</span>
<span class="linenr">10: </span>    <span style="color: #5FD7FF;">}</span>
<span class="linenr">11: </span><span style="color: #AF87FF;">}</span>;
<span class="linenr">12: </span>
<span class="linenr">13: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#19978;&#38754;&#30340;&#21442;&#25968;&#21015;&#34920;&#20013;&#26377;&#19968;&#20010; `changeOrigin` &#21442;&#25968;, &#26159;&#19968;&#20010;&#24067;&#23572;&#20540;,</span>
<span class="linenr">14: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#35774;&#32622;&#20026; `true`, &#26412;&#22320;&#23601;&#20250;&#34394;&#25311;&#19968;&#20010;&#26381;&#21153;&#22120;&#25509;&#25910;&#20320;&#30340;&#35831;&#27714;&#24182;&#20195;&#20320;&#21457;&#36865;&#35813;&#35831;&#27714;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5a36a39" class="outline-2">
<h2 id="org5a36a39">配置多个规则：Vue-cli中 `proxyTable` 配置接口</h2>
<div class="outline-text-2" id="text-org5a36a39">
<div class="org-src-container">
<pre class="src src-js"><span class="linenr"> 1: </span>module.exports = <span style="color: #AF87FF;">{</span>
<span class="linenr"> 2: </span>    dev: <span style="color: #5FD7FF;">{</span>
<span class="linenr"> 3: </span>        <span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#38745;&#24577;&#36164;&#28304;&#25991;&#20214;&#22841;</span>
<span class="linenr"> 4: </span>        assetsSubDirectory: <span style="color: #CDC673;">'static'</span>,
<span class="linenr"> 5: </span>        <span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#21457;&#24067;&#36335;&#24452;</span>
<span class="linenr"> 6: </span>        assetsPublicPath: <span style="color: #CDC673;">'/'</span>,
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span>        <span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#20195;&#29702;&#37197;&#32622;&#34920;&#65292;&#22312;&#36825;&#37324;&#21487;&#20197;&#37197;&#32622;&#29305;&#23450;&#30340;&#35831;&#27714;&#20195;&#29702;&#21040;&#23545;&#24212;&#30340;API&#25509;&#21475;</span>
<span class="linenr"> 9: </span>        <span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#20351;&#29992;&#26041;&#27861;&#65306;https://vuejs-templates.github.io/webpack/proxy.html</span>
<span class="linenr">10: </span>        proxyTable: <span style="color: #87D700;">{</span>
<span class="linenr">11: </span>            <span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#20363;&#22914;&#23558;'localhost:8080/api/xxx'&#20195;&#29702;&#21040;'https://wangyaxing.cn/api/xxx'</span>
<span class="linenr">12: </span>            <span style="color: #CDC673;">'/api'</span>: <span style="color: #CDC673;">{</span>
<span class="linenr">13: </span>                target: <span style="color: #CDC673;">'https://wangyaxing.cn'</span>, <span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#25509;&#21475;&#30340;&#22495;&#21517;</span>
<span class="linenr">14: </span>                secure: <span style="color: #AF87FF;">false</span>,                   <span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#22914;&#26524;&#26159;https&#25509;&#21475;&#65292;&#38656;&#35201;&#37197;&#32622;&#36825;&#20010;&#21442;&#25968;</span>
<span class="linenr">15: </span>                changeOrigin: <span style="color: #AF87FF;">true</span>,              <span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#22914;&#26524;&#25509;&#21475;&#36328;&#22495;&#65292;&#38656;&#35201;&#36827;&#34892;&#36825;&#20010;&#21442;&#25968;&#37197;&#32622;</span>
<span class="linenr">16: </span>            <span style="color: #CDC673;">}</span>,
<span class="linenr">17: </span>            <span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#20363;&#22914;&#23558;'localhost:8080/img/xxx'&#20195;&#29702;&#21040;'https://cdn.wangyaxing.cn/xxx'</span>
<span class="linenr">18: </span>            <span style="color: #CDC673;">'/img'</span>: <span style="color: #CDC673;">{</span>
<span class="linenr">19: </span>                target: <span style="color: #CDC673;">'https://cdn.wangyaxing.cn'</span>, <span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#25509;&#21475;&#30340;&#22495;&#21517;</span>
<span class="linenr">20: </span>                secure: <span style="color: #AF87FF;">false</span>,                       <span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#22914;&#26524;&#26159;https&#25509;&#21475;&#65292;&#38656;&#35201;&#37197;&#32622;&#36825;&#20010;&#21442;&#25968;</span>
<span class="linenr">21: </span>                changeOrigin: <span style="color: #AF87FF;">true</span>,                  <span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#22914;&#26524;&#25509;&#21475;&#36328;&#22495;&#65292;&#38656;&#35201;&#36827;&#34892;&#36825;&#20010;&#21442;&#25968;&#37197;&#32622;</span>
<span class="linenr">22: </span>                pathRewrite: <span style="color: #FF8C00;">{</span><span style="color: #CDC673;">'^/img'</span>: <span style="color: #CDC673;">''</span><span style="color: #FF8C00;">}</span>           <span style="color: #8B8878;">// </span><span style="color: #8B8878;">pathRewrite &#26469;&#37325;&#20889;&#22320;&#22336;&#65292;&#23558;&#21069;&#32512; '/api' &#36716;&#20026; '/'&#12290;</span>
<span class="linenr">23: </span>            <span style="color: #CDC673;">}</span>
<span class="linenr">24: </span>        <span style="color: #87D700;">}</span>,
<span class="linenr">25: </span>        <span style="color: #8B8878;">// </span><span style="color: #8B8878;">Various Dev Server settings</span>
<span class="linenr">26: </span>        host: <span style="color: #CDC673;">'localhost'</span>, <span style="color: #8B8878;">// </span><span style="color: #8B8878;">can be overwritten by process.env.HOST</span>
<span class="linenr">27: </span>        port: 4200,        <span style="color: #8B8878;">// </span><span style="color: #8B8878;">can be overwritten by process.env.PORT, if port is in use, a free one will be determined</span>
<span class="linenr">28: </span>    <span style="color: #5FD7FF;">}</span>
<span class="linenr">29: </span><span style="color: #AF87FF;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6fcdfb3" class="outline-2">
<h2 id="org6fcdfb3">更多参数</h2>
<div class="outline-text-2" id="text-org6fcdfb3">
<pre class="example">
dev-server 使用了非常强大的http-proxy-middleware ,
http-proxy-middleware 基于 http-proxy 实现的，
可以查看 http-proxy 的源码和文档：https://github.com/nodejitsu/node-http-proxy。

- target：要使用url模块解析的url字符串
- forward：要使用url模块解析的url字符串
- agent：要传递给 http(s)s.request 的对象（请参阅 Node 的 https 代理和 http 代理对象）
- ssl：要传递给 https.createServer() 的对象
- ws：true / false，是否代理 websockets
- xfwd：true / false，添加 x-forward 标头
- secure：true / false，是否验证 SSL Certs
- toProxy：true / false，传递绝对URL作为路径（对代理代理很有用）
- prependPath：true / false，默认值：true - 指定是否要将目标的路径添加到代理路径
- ignorePath：true / false，默认值：false - 指定是否要忽略传入请求的代理路径（注意：如果需要，您必须附加/手动）
- localAddress：要为传出连接绑定的本地接口字符串
- changeOrigin：true / false，默认值：false - 将主机标头的原点更改为目标 URL
</pre>
</div>
</div>

<div id="outline-container-orge1e0de9" class="outline-2">
<h2 id="orge1e0de9">vue-element-admin分析代码</h2>
<div class="outline-text-2" id="text-orge1e0de9">
<div class="org-src-container">
<pre class="src src-js"><span class="linenr"> 1: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#29615;&#22659;&#21464;&#37327;:VUE_APP_BASE_API = '/dev-api'</span>
<span class="linenr"> 2: </span><span style="color: #8B8878;">// </span><span style="color: #8B8878;">&#21457;&#36865;&#30340;&#35831;&#27714;:127.0.0.1/dev-api/login</span>
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span>proxy: <span style="color: #AF87FF;">{</span>
<span class="linenr"> 5: </span>    <span style="color: #8B8878;">// </span><span style="color: #8B8878;">change dev-api/login =&gt; /login</span>
<span class="linenr"> 6: </span>    <span style="color: #8B8878;">// </span><span style="color: #8B8878;">detail: https://cli.vuejs.org/config/#devserver-proxy</span>
<span class="linenr"> 7: </span>    <span style="color: #5FD7FF;">[</span>process.env.VUE_APP_BASE_API<span style="color: #5FD7FF;">]</span>: <span style="color: #5FD7FF;">{</span>
<span class="linenr"> 8: </span>        target: <span style="color: #CDC673;">`https://my.baidu.com`</span>,
<span class="linenr"> 9: </span>        changeOrigin: <span style="color: #AF87FF;">true</span>,
<span class="linenr">10: </span>        pathRewrite: <span style="color: #87D700;">{</span>
<span class="linenr">11: </span>            <span style="color: #CDC673;">[</span><span style="color: #CDC673;">'^'</span> + process.env.VUE_APP_BASE_API<span style="color: #CDC673;">]</span>: <span style="color: #CDC673;">''</span>
<span class="linenr">12: </span>        <span style="color: #87D700;">}</span>
<span class="linenr">13: </span>    <span style="color: #5FD7FF;">}</span>
<span class="linenr">14: </span><span style="color: #AF87FF;">}</span>,
</pre>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://blog.csdn.net/guzhao593/article/details/81516135">https://blog.csdn.net/guzhao593/article/details/81516135</a>
</p></div></div>

</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Date: 2020-11-02 Mon 14:39</p>
<p class="author">Author: Jack Liu</p>
<p class="date">Created: 2020-11-02 Mon 15:07</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
